; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	thermograph0 - mode
	infrared1 - mode
	thermograph2 - mode
	Star2 - direction
	Star0 - direction
	GroundStation1 - direction
	Star3 - direction
	Planet4 - direction
	Star5 - direction
	Star6 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 145)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star0)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 GroundStation1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 128)
	(= (data Star3 thermograph0) 131)
	(= (data Planet4 thermograph0) 177)
	(= (data Star5 thermograph0) 46)
	(= (data Star6 thermograph0) 226)
	(= (data Star3 infrared1) 114)
	(= (data Planet4 infrared1) 12)
	(= (data Star5 infrared1) 159)
	(= (data Star6 infrared1) 262)
	(= (data Star3 thermograph2) 274)
	(= (data Planet4 thermograph2) 217)
	(= (data Star5 thermograph2) 31)
	(= (data Star6 thermograph2) 239)
	(= (slew_time Star2 Star0) 22.85)
	(= (slew_time Star0 Star2) 22.85)
	(= (slew_time Star2 GroundStation1) 6.71)
	(= (slew_time GroundStation1 Star2) 6.71)
	(= (slew_time GroundStation1 Star0) 27.99)
	(= (slew_time Star0 GroundStation1) 27.99)
	(= (slew_time Star3 Star0) 13.23)
	(= (slew_time Star0 Star3) 13.23)
	(= (slew_time Star3 GroundStation1) 36.77)
	(= (slew_time GroundStation1 Star3) 36.77)
	(= (slew_time Star3 Star2) 61.14)
	(= (slew_time Star2 Star3) 61.14)
	(= (slew_time Planet4 Star0) 4.109)
	(= (slew_time Star0 Planet4) 4.109)
	(= (slew_time Planet4 GroundStation1) 37.19)
	(= (slew_time GroundStation1 Planet4) 37.19)
	(= (slew_time Planet4 Star2) 36.64)
	(= (slew_time Star2 Planet4) 36.64)
	(= (slew_time Planet4 Star3) 9.294)
	(= (slew_time Star3 Planet4) 9.294)
	(= (slew_time Star5 Star0) 38.28)
	(= (slew_time Star0 Star5) 38.28)
	(= (slew_time Star5 GroundStation1) 30.98)
	(= (slew_time GroundStation1 Star5) 30.98)
	(= (slew_time Star5 Star2) 0.3784)
	(= (slew_time Star2 Star5) 0.3784)
	(= (slew_time Star5 Star3) 56.07)
	(= (slew_time Star3 Star5) 56.07)
	(= (slew_time Star5 Planet4) 81.5)
	(= (slew_time Planet4 Star5) 81.5)
	(= (slew_time Star6 Star0) 32.6)
	(= (slew_time Star0 Star6) 32.6)
	(= (slew_time Star6 GroundStation1) 66.71)
	(= (slew_time GroundStation1 Star6) 66.71)
	(= (slew_time Star6 Star2) 28.28)
	(= (slew_time Star2 Star6) 28.28)
	(= (slew_time Star6 Star3) 11.5)
	(= (slew_time Star3 Star6) 11.5)
	(= (slew_time Star6 Planet4) 42.45)
	(= (slew_time Planet4 Star6) 42.45)
	(= (slew_time Star6 Star5) 78.38)
	(= (slew_time Star5 Star6) 78.38)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(have_image Star5 thermograph0)
	(have_image Star6 thermograph0)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 star0 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star0)
   changed: (fuel satellite0) from 145 to 112.4, (fuel-used) from 0 to 32.6
   goals met: 0 of 2
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 2
3. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 0 of 2
4. (turn_to satellite0 star5 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 112.4 to 74.12, (fuel-used) from 32.6 to 70.88
   goals met: 0 of 2
5. (take_image satellite0 star5 instrument0 thermograph0)
   added: (have_image star5 thermograph0)
   changed: (data_capacity satellite0) from 1000 to 954, (data-stored) from 0 to 46
   goals met: 1 of 2
6. (turn_to satellite0 star2 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 74.12 to 73.7416, (fuel-used) from 70.88 to 71.2584
   goals met: 1 of 2
7. (turn_to satellite0 star6 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 73.7416 to 45.4616, (fuel-used) from 71.2584 to 99.5384
   goals met: 1 of 2
8. (take_image satellite0 star6 instrument0 thermograph0)
   added: (have_image star6 thermograph0)
   changed: (data_capacity satellite0) from 954 to 728, (data-stored) from 46 to 272
   goals met: 2 of 2
